app/controllers/api/feeds_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = $1 AND "feeds"."id" = $2 LIMIT 1  [["user_id", 1], ["id", "12"]]
---
  def show
    render :json => current_user.feeds.find(params[:id]), include: :latest_entries

INSERT INTO "feeds" ("created_at", "title", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = $1 AND "feeds"."url" = 'http://feeds.reuters.com/reuters/USVideoEntertainment' LIMIT 1  [["user_id", 2]]
---
  def create
    feed = current_user.feeds.find_or_create_by_url(feed_params[:url])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 3]]
---
  def destroy
    feed = Feed.find(params[:id])
    feed.destroy!